<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>Presentación | Presentación</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="Este curso es gratuito y lo puedes realizar incluso si no sabes nada de programación, sólo hace falta tener ganas de aprender. A pesar de esto, también puede serte útil si ya sabes HTML pero quieres perfeccionar o refrescar tus conocimientos sobre HTML5, CSS3 o JavaScript.">
        <meta name="generator" content="GitBook 2.6.6">
        
        <meta name="format-detection" content="telephone=no" />
        <meta name="msapplication-tap-highlight" content="no" />
        <!-- WARNING: for iOS 7, remove the width=device-width and height=device-height attributes. See https://issues.apache.org/jira/browse/CB-4323 -->
        <meta name="viewport" content="user-scalable=no, initial-scale=1, maximum-scale=1, minimum-scale=1, width=device-width, height=device-height, target-densitydpi=device-dpi" />

        <meta name="HandheldFriendly" content="true"/>
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./leccion1/que_vamos_a_necesitar.html" />
    
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="0"
        data-chapter-title="Presentación"
        data-filepath="README.md"
        data-basepath="."
        data-revision="Mon Jan 11 2016 19:29:12 GMT+0100 (CET)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter active" data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Presentación
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="leccion1/que_vamos_a_necesitar.html">
            
                
                    <a href="./leccion1/que_vamos_a_necesitar.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        ¿Qué vamos a necesitar?
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="chapter1.html">
            
                
                    <a href="./chapter1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        Conceptos básicos
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1" data-path="leccion1/servidores_web_y_http.html">
            
                
                    <a href="./leccion1/servidores_web_y_http.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.</b>
                        
                        Alojamiento y servidores HTTP
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="leccion1/navegadores_web.html">
            
                
                    <a href="./leccion1/navegadores_web.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.2.</b>
                        
                        Navegadores
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="leccion1/funcionamiento_de_las_urls.html">
            
                
                    <a href="./leccion1/funcionamiento_de_las_urls.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.3.</b>
                        
                        URLs
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="leccion1/peticiones_http.html">
            
                
                    <a href="./leccion1/peticiones_http.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.4.</b>
                        
                        Peticiones HTTP
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="leccion1/ejercicio.html">
            
                
                    <a href="./leccion1/ejercicio.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.5.</b>
                        
                        Ejercicio
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="leccion1/extra_opcional.html">
            
                
                    <a href="./leccion1/extra_opcional.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.6.</b>
                        
                        Recursos
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3" data-path="chapter2.html">
            
                
                    <a href="./chapter2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        Primeros pasos con HTML5
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1" data-path="leccion1/introduccion_a_html5.html">
            
                
                    <a href="./leccion1/introduccion_a_html5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.1.</b>
                        
                        Introducción a HTML5
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="leccion2/etiquetas_y_atributos.html">
            
                
                    <a href="./leccion2/etiquetas_y_atributos.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.2.</b>
                        
                        Etiquetas y atributos
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="leccion2/anidacion_de_etiquetas.html">
            
                
                    <a href="./leccion2/anidacion_de_etiquetas.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.3.</b>
                        
                        Anidación de etiquetas
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="leccion2/estructura_basica_de_una_pagina_md.html">
            
                
                    <a href="./leccion2/estructura_basica_de_una_pagina_md.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.4.</b>
                        
                        Estructura básica de una página
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="leccion2/etiquetas_basicas.html">
            
                
                    <a href="./leccion2/etiquetas_basicas.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.5.</b>
                        
                        Etiquetas básicas
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.6" data-path="leccion2/ejercicio.html">
            
                
                    <a href="./leccion2/ejercicio.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.6.</b>
                        
                        Ejercicio
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.7" data-path="leccion2/recursos.html">
            
                
                    <a href="./leccion2/recursos.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.7.</b>
                        
                        Recursos
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="4" data-path="chapter3.html">
            
                
                    <a href="./chapter3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        Nuestro primer HTML
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >Presentación</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="presentaci&#xF3;n">Presentaci&#xF3;n</h1>
<p>Este curso es <strong>gratuito</strong> y lo puedes realizar <strong>incluso si no sabes nada de programaci&#xF3;n</strong>, s&#xF3;lo hace falta tener ganas de aprender. A pesar de esto, tambi&#xE9;n puede serte &#xFA;til si ya sabes HTML pero quieres perfeccionar o refrescar tus conocimientos sobre HTML5, CSS3 o JavaScript.</p>
<p>A lo largo del mismo te voy a:</p>
<ul>
<li>Ense&#xF1;ar los elementos m&#xE1;s comunes de HTML5, CSS3 y JavaScript, osea los que usaremos el d&#xED;a d&#xED;a.</li>
<li>Mostrar d&#xF3;nde podr&#xE1;s resolver tus dudas cuando tengas problemas.</li>
<li>Explicar c&#xF3;mo trabajar con algunas de las herramientas que usan los profesionales del mundo real como son <a href="http://github.com/" target="_blank">Github</a> o las <a href="https://developer.chrome.com/devtools" target="_blank">herramientas para desarrolladores de Google Chrome</a>.</li>
</ul>
<p>Es <strong>importante</strong> saber que en el mundo de la programaci&#xF3;n hay muchas formas de resolver un mismo problema, y que todas ellas pueden ser igualmente v&#xE1;lidas. 
Dicho esto, quiero aclarar que <strong>el objetivo del curso no es</strong> aprender todas y cada una de las formas de resolver un problema (esto se va aprendiendo con a&#xF1;os de pr&#xE1;ctica), y es por ello que <strong>no entrar&#xE9; en profundidad en todos y cada uno de los elementos y caracter&#xED;sticas</strong> de cada lenguaje.</p>
<p><strong>Las definiciones estar&#xE1;n simplificadas</strong>, esto est&#xE1; hecho a conciencia ya que como dec&#xED;a antes, no he querido asumir que tengas ning&#xFA;n conocimiento previo sobre desarrollo web. Por eso, para facilitarte la comprensi&#xF3;n y evitar distraerte del objetivo del curso, te explicar&#xE9; conceptos en muchas ocasiones que no ser&#xE1;n 100% precisos pero que s&#xED; correctos.</p>
<p>As&#xED; que <strong>no tomes todas las definiciones al pie de la letra</strong>, t&#xF3;malas como definiciones lo suficiente buenas como para ayudarte a entender el contexto. De todos modos, siempre que se d&#xE9; este caso te a&#xF1;adir&#xE9; un enlace a un recurso con m&#xE1;s informaci&#xF3;n o a&#xF1;adir&#xE9; un <a href="http://dle.rae.es/?id=Yk4qfET" target="_blank">super&#xED;ndice</a> con aclaraciones al final de la p&#xE1;gina.</p>
<p><strong>El objetivo del curso es dotarte de una buena base</strong> que te permita sentirte lo suficientemente seguro<sup>1</sup> para afrontar cualquier proyecto y as&#xED; seguir aprendiendo. Para ello nos centraremos solamente en los conocimientos y herramientas m&#xE1;s importantes de un <a href="https://en.wikipedia.org/wiki/Front_end_development" target="_blank">desarrollador front-end</a><sup>2</sup>.</p>
<h2 id="formato">Formato</h2>
<p>Este es el material escrito del <a href="http://www.cursohtml5desdecero.com/" target="_blank">Curso de HTML5, CSS3 y JS desde cero</a>, <strong>si quieres puedes estudiarte este curso por tu cuenta, o inscribirte al formato <a href="https://es.wikipedia.org/wiki/Mooc" target="_blank">MOOC</a> a trav&#xE9;s de la web</strong> para que te avise en las pr&#xF3;ximas ediciones que organice.</p>
<p>Estas ediciones que se celebran peri&#xF3;dicamente consisten en ver una serie de v&#xED;deo-tutoriales y hacer unos ejercicios que te enviar&#xE9; semanalmente. La carga de trabajo pretende ser menor a 3 horas semanales e incluyen una sesi&#xF3;n online (en grupo) de 1h a la semana para resolver dudas.</p>
<p>El formato MOOC tendr&#xE1; una <strong>duraci&#xF3;n aproximada de 6 semanas</strong>.</p>
<h2 id="dudas-ideas-sugerencias-y-contribuciones">Dudas, ideas, sugerencias, y contribuciones</h2>
<p>Adem&#xE1;s de resolver dudas en la sesiones online semanales, podr&#xE1;s realizar cualquier pregunta, o aportar cualquier idea o sugerencia en cualquier momento a trav&#xE9;s <a href="https://github.com/hhkaos/cursohtml5desdecero/issues" target="_blank">del apartado de issues del proyecto en Github</a>.</p>
<p>Recuerda, que no te de verg&#xFC;enza preguntar cualquier duda que te surja, por simple que te parezca, si te ha surgido a ti, ten por seguro que le surgir&#xE1; a m&#xE1;s personas. <strong>As&#xED; me ayudar&#xE1;s tambi&#xE9;n saber qu&#xE9;  aclaraciones a&#xF1;adir o qu&#xE9; mejoras puedo hacer al contenido del curso</strong> para facilitarles el aprendizaje a otras personas que vengan detr&#xE1;s.</p>
<p>Adem&#xE1;s si consigues terminar el curso <strong>sin ninguna duda</strong>, el d&#xED;a que est&#xE9;s haciendo un proyecto y algo no te funcione sabr&#xE1;s mucho mejor por d&#xF3;nde empezar a buscar los errores. </p>
<p>Y si te sientes c&#xF3;modo usando <a href="https://github.com/" target="_blank">Github</a>, puedes hacer un <a href="https://help.github.com/articles/using-pull-requests/" target="_blank">pull request</a> al repositorio resolviendo cualquier error que encuentres.</p>
<h2 id="autores">Autor(es)</h2>
<p>Mi nombre es <a href="http://rauljimenez.info" target="_blank">Ra&#xFA;l Jim&#xE9;nez Ortega</a>, he creado este curso bas&#xE1;ndome principalmente en <a href="http://rauljimenez.info/experiencia/" target="_blank">mis a&#xF1;os de experiencia haciendo webs (llevo desde 1999) y dando formaci&#xF3;n (desde 2009)</a>, pero adem&#xE1;s he revisado las mejores fuentes que conozco para seleccionar lo mejor de cada curso/tutorial que he encontrado en estos a&#xF1;os en Internet.</p>
<p>Aunque inicialmente me he lanzado s&#xF3;lo a crear este curso, mi objetivo es animar a que otros profesionales aporten su granito de arena para mejorar el contenido y mantener este curso actualizado durante mucho tiempo, <strong>es por eso que he decidido liberar este libro licenci&#xE1;ndolo como Creative Commons (<a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC-BY-NC-SA 4.0 International</a>)</strong>.</p>
<p>Por supuesto, las personas que contribuyan tendr&#xE1;n su reconocimiento no s&#xF3;lo en <a href="https://github.com/hhkaos/cursohtml5desdecero/graphs/contributors" target="_blank">Github</a> sino tambi&#xE9;n dentro de los contenidos del libro.</p>
<h2 id="motivaci&#xF3;n--&#xBF;por-qu&#xE9;">Motivaci&#xF3;n - &#xBF;Por qu&#xE9;?</h2>
<p>&#xBF;Por qu&#xE9; otro curso de HTML/HTML5?, pues las razones que me han llevado a lanzarme a esta aventura son:</p>
<ol>
<li><strong>Compartir los trucos y consejos</strong>: a lo largo de estos a&#xF1;os he ido aprendiendo muchos trucos y muchas lecciones sobre c&#xF3;mo ser m&#xE1;s productivo y me gustar&#xED;a compartirlos contigo.</li>
<li><strong>Asentar una buena base</strong>: despu&#xE9;s de revisar muchos cursos (algunos de ellos muy buenos), tengo la sensaci&#xF3;n de que ninguno explica todos los conceptos necesarios para crear una buena base que te permita sentirte c&#xF3;modo a la hora de continuar creciendo por tu cuenta.</li>
<li><strong>Creo que los tiempos han cambiado</strong>: y creo que hay much&#xED;simas personas con mucho potencial a las que saber HTML, CSS y JavaScript les &quot;dar&#xED;a alas&quot; y les abrir&#xED;an muchas puertas profesionales.</li>
<li><strong>Disfruto compartiendo lo que s&#xE9; y ayudando a los dem&#xE1;s</strong>: siempre quise montar una empresa para crear alg&#xFA;n producto que mejorase aunque fuese un poco la vida de miles/millones de personas, pero despu&#xE9;s de 6 a&#xF1;os me he dado cuenta de que tambi&#xE9;n es posible cambiar la vida de muchas personas ense&#xF1;&#xE1;ndoles lo que s&#xE9;.</li>
</ol>
<p>Todo esto ha sido m&#xE1;s que suficiente para que decida a dedicar <strong>muchas horas</strong> (y cari&#xF1;o) de mi tiempo libre para ir creando poco a poco los contenido de este curso.</p>
<p><small>Aclaraciones:</small><br>
<small>1. A lo largo de todo el libro usar&#xE9; el masculino por facilitar la lectura evitando los: &quot;seguro/a&quot;, o los &quot;segur@&quot;, espero que nadie se ofenda ;-P.</small><br>
<small>2. Un programador front-end no es m&#xE1;s que un programador que domina HTML, CSS y JavaScript.</small></p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        
        <a href="./leccion1/que_vamos_a_necesitar.html" class="navigation navigation-next navigation-unique" aria-label="Next page: ¿Qué vamos a necesitar?"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
        <script type="text/javascript" src="js/config.js"></script>
        <script type="text/javascript" src="js/index.js"></script>
        <script type="text/javascript">
            app.initialize();
        </script>
    </body>
    
</html>
